# GetSeverity Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailuresAccessor..::..GetSeverity Method
FailuresAccessor Class See Also
---
Provides access to the current failure severity.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FailureSeverity GetSeverity()
```

Visual Basic
---
```text
Public Function GetSeverity As FailureSeverity
```

Visual C++
---
```text
public:
FailureSeverity GetSeverity()
```

# ### Return Value
The highest severity of a failure message currently posted in the document.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This FailuresAccessor is inactive (is used outside of failures processing). |

# See Also
FailuresAccessor Class
Autodesk.Revit.DB Namespace